import { createInfo, createQ, createScaleQ } from "../helpers";
import type { Question } from "../types";

export const workQuestions: Question[] = [
  createQ(
    "w1",
    "work",
    "เมื่อได้รับมอบหมายงานใหม่ที่ยากๆ คุณจะ...",
    "รับด้วยความตื่นเต้น",
    "ขอเวลาศึกษาข้อมูลก่อน",
    "รู้สึกกังวลและเครียด",
    "https://images.unsplash.com/photo-1768185595109-18aded979f9d?w=600&auto=format&fit=crop&q=60&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxmZWF0dXJlZC1waG90b3MtZmVlZHw0fHx8ZW58MHx8fHx8"
  ),
  createScaleQ(
    "w2",
    "work",
    "ฉันมักจะตรวจสอบความถูกต้องของงานร้อยเรียบร้อยเสมอ",
    "disagree",
    "agree",
    "https://plus.unsplash.com/premium_photo-1763136099850-f73cacd820fa?w=600&auto=format&fit=crop&q=60&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxmZWF0dXJlZC1waG90b3MtZmVlZHw2fHx8ZW58MHx8fHx8"
  ),
  createQ(
    "w3",
    "work",
    "เมื่อมีความคิดเห็นไม่ตรงกันในที่ประชุม...",
    "เสนอความคิดเห็นแย้งทันที",
    "ฟังเงียบๆ แล้วค่อยไปคุยทีหลัง",
    "เออออไปตามน้ำ"
  ),
  createInfo("info_w1", "work", "คุณทำได้ดีมาก! มาลุยกันต่อครึ่งหลัง"), // หน้า 4
  createQ(
    "w4",
    "work",
    "ถ้างานเสร็จก่อนกำหนด คุณจะ...",
    "หางานอื่นทำต่อทันที",
    "ตรวจทานงานเดิมอีกรอบ",
    "พักผ่อน เล่นโซเชียล"
  ),
  createQ(
    "w5",
    "work",
    "คุณชอบสภาพแวดล้อมการทำงานแบบไหน...",
    "มีคนเยอะๆ คึกคัก",
    "เงียบสงบ เป็นส่วนตัว",
    "เปลี่ยนบรรยากาศไปเรื่อยๆ"
  ),
  createQ(
    "w6",
    "work",
    "เมื่อเพื่อนร่วมงานขอให้ช่วยงาน...",
    "ช่วยทันทีเต็มที่",
    "ดูลำดับความสำคัญก่อน",
    "ปฏิเสธถ้างานตัวเองยังไม่เสร็จ"
  ),
  createInfo("info_w2", "work", "อีกนิดเดียว จะรู้ผลลัพธ์แล้ว!"), // หน้า 8
  createQ(
    "w7",
    "work",
    "เป้าหมายในการทำงานของคุณคือ...",
    "ความสำเร็จและชื่อเสียง",
    "ความมั่นคงและรายได้",
    "ความสุขและความสมดุล"
  ),
  createQ(
    "w8",
    "work",
    "ถ้าหัวหน้าตำหนิงานของคุณ...",
    "เถียงเพื่อปกป้องตัวเอง",
    "รับฟังและนำไปปรับปรุง",
    "เสียใจและเก็บไปคิดมาก"
  ),
];
